# Ваше завдання - розробити функцію total_salary(path), 
# яка аналізує цей файл і повертає загальну та середню 
# суму заробітної плати всіх розробників.


# Вимоги до завдання:

# 1. Функція total_salary(path) має приймати один аргумент
#  - шлях до текстового файлу (path).
# 2. Файл містить дані про заробітні плати розробників, 
# розділені комами. Кожен рядок вказує на одного розробника.
# 3. Функція повинна аналізувати файл, обчислювати загальну 
# та середню суму заробітної плати.
# 4. Результатом роботи функції є кортеж із двох чисел: 
# загальної суми зарплат і середньої заробітної плати.


# Expected result: Загальна сума заробітної плати: 6000, Середня заробітна плата: 2000

total, average = total_salary("path/to/salary_file.txt")
print(f"Загальна сума заробітної плати: {total}, Середня заробітна плата: {average}")


def total_salary(path):
    with open(path, 'r') as file:
        salary = file.read().split(',')
        salary = [int(i) for i in salary]
        total = sum(salary)
        average = total / len(salary)
    return total, average